[
    {
        "q": "What happens when I buy DXMINER?",
        "a": "When you buy DXMINER, your SOL gets locked into the SOL DXMINER smart contract and rewards you with 8% daily return every day."
    },
    {
        "q": "Can I take my initial SOL back?",
        "a": "Over Time! DXMINER are not bought, DXMINER are mined therefore they can't be sold. Once DXMINER are mined they work for you indefinitely, providing you with an unlimited amount of SOL at a starting rate of 8% daily."
    },
    {
        "q": "How much are my fees?",
        "a": "There is a small 3% dev fee in order to pay for marketing costs and developing the SOL DXMINER ecosystem."
    },
    {
        "q": "When is the best time to buy DXMINER?",
        "a": "Always! No matter when you hire miners, you will begin with a return rate of 8% daily."
    },
    {
        "q": "How often should I compound?",
        "a": "WE recommend that you compound at least once per day but you are free to do so as often as you wish."
    },
    {
        "q": "How is SOL DXMINER sustainable?",
        "a": "DXMINER are sustained by continued community support, just as every other crypto coin, token or project. The difference is that since there is no token, there is no price to dump. As long as DXMINER are mining in the contract, there will be rewards!"
    },
    {
        "q": "How to use DXMINER on my phone?",
        "a": "You can either use an app with a dapp browser and choose the Metamask/Injected option or simply use any browser that you want and choose WalletConnect to connect to your wallet's app on your phone."
    },
    {
        "q": "Is it better to Compound or Harvest?",
        "a": "By design, compounding will be more profitable than Harvesting in the long-term."
    },
    {
        "q": "How do referrals work?",
        "a": "Once your BSC wallet is connected to the SOL Miner website, you will notice your referral address appear at the bottom of the page. When a new user hires miners after clicking your personal referral link, the contract will send a SOL value equal to 8% instantly to your SOL DXMINER. Be smart, use it to buy DXMINER and build yourself a stream of income."
    },
    {
        "q": "When did SOLDXMINER launch?",
        "a": "It launched April. 25th, 2022."
    }
]